/* automatically generated by rust-bindgen 0.71.1 */

#![allow(non_upper_case_globals)]

pub type __pid_t = ::std::os::raw::c_int;
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_walker_discovery_opts {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_walker_opts {
    pub pidCount: usize,
    pub pids: *mut pid_t,
    pub manualSymbolRefresh: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stack_walker_opts"][::std::mem::size_of::<stack_walker_opts>() - 24usize];
    ["Alignment of stack_walker_opts"][::std::mem::align_of::<stack_walker_opts>() - 8usize];
    ["Offset of field: stack_walker_opts::pidCount"]
        [::std::mem::offset_of!(stack_walker_opts, pidCount) - 0usize];
    ["Offset of field: stack_walker_opts::pids"]
        [::std::mem::offset_of!(stack_walker_opts, pids) - 8usize];
    ["Offset of field: stack_walker_opts::manualSymbolRefresh"]
        [::std::mem::offset_of!(stack_walker_opts, manualSymbolRefresh) - 16usize];
};
pub type symbol_id_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_walker_frame {
    pub symbol_id: symbol_id_t,
    pub inst_idx: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stack_walker_frame"][::std::mem::size_of::<stack_walker_frame>() - 8usize];
    ["Alignment of stack_walker_frame"][::std::mem::align_of::<stack_walker_frame>() - 4usize];
    ["Offset of field: stack_walker_frame::symbol_id"]
        [::std::mem::offset_of!(stack_walker_frame, symbol_id) - 0usize];
    ["Offset of field: stack_walker_frame::inst_idx"]
        [::std::mem::offset_of!(stack_walker_frame, inst_idx) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_walker_run {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn pystacks_init(
        bpf_skel_obj: *mut bpf_object,
        opts: *mut stack_walker_opts,
        discovery_opts: *mut stack_walker_discovery_opts,
    ) -> *mut stack_walker_run;
}
unsafe extern "C" {
    pub fn pystacks_symbolize_function(
        run: *mut stack_walker_run,
        stackframe: *const stack_walker_frame,
        function_name_buffer: *mut ::std::os::raw::c_char,
        function_name_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pystacks_symbolize_filename_line(
        run: *mut stack_walker_run,
        stackframe: *const stack_walker_frame,
        filename_buffer: *mut ::std::os::raw::c_char,
        filename_len: usize,
        line_number: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pystacks_free(run: *mut stack_walker_run);
}
unsafe extern "C" {
    pub fn pystacks_load_symbols(run: *mut stack_walker_run);
}
unsafe extern "C" {
    pub fn pystacks_add_pid(run: *mut stack_walker_run, pid: pid_t);
}
pub const strobelight_lib_print_level_STROBELIGHT_LIB_WARN: strobelight_lib_print_level = 0;
pub const strobelight_lib_print_level_STROBELIGHT_LIB_INFO: strobelight_lib_print_level = 1;
pub const strobelight_lib_print_level_STROBELIGHT_LIB_DEBUG: strobelight_lib_print_level = 2;
pub type strobelight_lib_print_level = ::std::os::raw::c_uint;
pub type strobelight_lib_print_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        level: strobelight_lib_print_level,
        arg1: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    #[doc = " @brief **strobelight_lib_set_print()** sets user-provided log callback\n function to be used for strobelight-lib warnings and informational messages.\n If the user callback is not set, messages are not logged.\n @param fn The log print function. NULL by default and does not print\n anything.\n @return Pointer to old print function.\n\n This function is thread-safe."]
    pub fn strobelight_lib_set_print(fn_: strobelight_lib_print_fn_t)
        -> strobelight_lib_print_fn_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bpf_object {
    _unused: [u8; 0],
}
